using Microsoft.EntityFrameworkCore;
using PublishingHouse.DAL.Entities;
using PublishingHouse.DAL.EntityConfigurations;
using System;
using System.Collections.Generic;
using System.Text;

namespace PublishingHouse.DAL.Extensions
{
    public static class ModelBuilderExtensions
    {
        public static void SetConfigurations(this ModelBuilder modelBuilder)
        {
            modelBuilder.ApplyConfiguration(new AuthorConfiguration());
            modelBuilder.ApplyConfiguration(new BookAuthorConfiguration());
            modelBuilder.ApplyConfiguration(new BookConfiguration());
            modelBuilder.ApplyConfiguration(new BookOrderConfiguration());
            modelBuilder.ApplyConfiguration(new CommentConfiguration());
            modelBuilder.ApplyConfiguration(new OrderConfiguration());
        }

        public static void Seed(this ModelBuilder modelBuilder) 
        {
            modelBuilder.Entity<Category>()
                .HasData(
                    new Category
                    {
                        Id = 1,
                        Name = "Художня література"
                    },
                    new Category
                    {
                        Id = 2,
                        Name = "Навчальна та довідкова література"
                    }
                );
            modelBuilder.Entity<Author>()
                .HasData(
                    new Author
                    {
                        Id = 1,
                        Name = "Вацлав Гавел (Переклад з чеської: Надія Лобур, Надія Брилинська, Наталія Ємчура)"
                    },
                    new Author
                    {
                        Id = 2,
                        Name = "Спільне видання"
                    },
                    new Author
                    {
                        Id = 3,
                        Name = "Дмитро Безуглий"
                    },
                    new Author
                    {
                        Id = 4,
                        Name = "Олександр Богданович"
                    },
                    new Author
                    {
                        Id = 5,
                        Name = "Дмитро Шурхало"
                    },
                    new Author
                    {
                        Id = 6,
                        Name = "Ева Магітт"
                    },
                    new Author
                    {
                        Id = 7,
                        Name = "Павло Лозинський"
                    },
                    new Author
                    {
                        Id = 8,
                        Name = "Тетяна Костенко"
                    },
                    new Author
                    {
                        Id = 9,
                        Name = "Зорислава Ромовська"
                    },
                    new Author
                    {
                        Id = 10,
                        Name = "Анатолій Капелюшний"
                    },
                    new Author
                    {
                        Id = 11,
                        Name = "Зенон Дмитровський"
                    },
                    new Author
                    {
                        Id = 12,
                        Name = "Борис Потятиник"
                    },
                    new Author
                    {
                        Id = 13,
                        Name = "Ігор Лубкович"
                    },
                    new Author
                    {
                        Id = 14,
                        Name = "Володимир Здоровега"
                    },
                    new Author
                    {
                        Id = 15,
                        Name = "Людмила Мар’їна"
                    },
                    new Author
                    {
                        Id = 16,
                        Name = "Юрій Зацний"
                    },
                    new Author
                    {
                        Id = 17,
                        Name = " С. Мовчан"
                    },
                    new Author
                    {
                        Id = 18,
                        Name = "Г. Кипаренко"
                    }
                );
            modelBuilder.Entity<Book>()
                .HasData(
                    new Book
                    {
                        Id = 1,
                        Title = "Прошу коротко: розмова з Карелом Гвіждялою, примітки, документи",
                        Language = "українська",
                        Year = 2016,
                        Format = "70х100/16 ",
                        Cover = "м'яка",
                        PagesAmount = 288,
                        Description = "Це остання прижиттєва книга останнього Президента Чехословаччини і першого Президента Чеської Республіки Вацлава Гавела, світла особа якого досі асоціюється у багатьох людей з уособленням честі, обов’язку і беззаперечного морального авторитету. Своєрідний белетризований підсумок власного життя автор подає у надзвичайно оригінальній оправі колажу, у якому природно переплелися спогади, роздуми, допити-інтерв’ю із самим собою, фрагменти особистих щоденників та службових записок. Це, по суті, дуже густий і пізнавальний «концентрат» знакових подій, рішень та дій недалекого минулого за участі багатьох непересічних персонажів. Переконані, що ця книга, вперше видана українською мовою, здатна стати настільним підручником-настановою для вітчизняних державотворців та фахівців-гуманітаріїв, а також – вагомою підмогою для всіх, хто намагається збагнути сутність політичних процесів сучасності.",
                        Price = 130
                    }, 
                    new Book
                    {
                        Id = 2,
                        Title = "Сибірський семестр: пригоди, спогади, роздуми студзагонівців",
                        Language = "українська",
                        Year = 2018,
                        Format = "60х90/16",
                        Cover = "тверда",
                        PagesAmount = 288,
                        Description = "Пропонована авторським колективом книга про пригоди й перипетії студентів у третьому трудовому семестрі – це щирі і відверті спогади, роздуми і зізнання учасників студзагонівського руху про роки своєї молодості і дивовижний світ Сибіру, Казахстану, Далекого Сходу та Крайньої Півночі. Їх романтика поєднувалась із прагматизмом. Студенти самоорганізовувались, мандрували у незвідані краї, адаптовувались до місцевих реалій, закохувались, одружувались і щиро вірили у перспективу завтрашнього дня. Книга написана у доступному стилі і розрахована на якнайширшу аудиторію.",
                        Price = 100
                    },
                    new Book
                    {
                        Id = 3,
                        Title = "Когда сердце плачет, или Казнь одержимости",
                        Language = "російська",
                        Year = 2017,
                        Format = "60х90/16",
                        Cover = "тверда",
                        PagesAmount = 712,
                        Description = "Франция, Долина Замков. Из таинственного дома на холме «Medmor» исчезает знаменитая писательница, автор исторических романов Гаэлль Вильнёв. Ее имя известно всей Европе: она занимает первые строчки в рейтинге популярных писателей- романистов. Дело берут под свой контроль префект департамента и лично министр внутренних дел Франции. Являясь близким другом Гаэлль, к расследованию подключается бывший комиссар национальной полиции департамента Лютгард Аллар. Основная версия – похищение. Но от похитителей не поступает никаких требований. Одновременно с этим начинают происходить необъяснимые мистические события, связанные с теми, что свершались более трехсот лет назад, когда еще были сильны Инквизиция и Святой Трибунал. Противостояние тайных религиозных орденов, одержимость демонами и экзорцизм, странная община деревни Крессо и, конечно же, дом на холме «Medmor» – символ сатанизма и пристанище чернокнижников. С этим придется столкнуться Лютгарду Аллару и его бывшему подчиненному, а ныне комиссару полиции Ренальду Рою. Ошеломительный финал книги никого не оставит равнодушным…",
                        Price = 150
                    },
                    new Book
                    {
                        Id = 4,
                        Title = "Отдых по пятницам",
                        Language = "російська",
                        Year = 2018,
                        Format = "60х84/16",
                        Cover = "тверда",
                        PagesAmount = 368,
                        Description = "Действия первой книги серии \"Граф Воронцов\" разворачиваются в лихие 90‐е, сразу же после развала СССР. Главный герой романа Данила Воронцов приходится потомком знаменитому графу и светлейшему князю, генерал‐фельдмаршалу и герою войны 1812‐го года Михаилу Семеновичу Воронцову. В погоне за легкой наживой он вместе со своими друзьями оказывается втянут в сомнительную криминальную историю, связанную с кражей одной вещи, которая неожиданно для них представляет огромную ценность для криминальных авторитетов и руководства города и области. Завладев этой вещью, герои книги сталкиваются с начавшейся войной между уголовными авторитетами и криминальными разборками. Они скрываются от преследования бандитов и уголовного розыска, а их авантюрные приключения насыщены комедийными и одновременно с этим жестокими событиями, характеризующими период времени начала 90‐х годов. Книга \"Отдых по пятницам\" ‐ это горячая смесь авантюрно‐приключенческого, криминального и детективного жанров современной литературы. Читая ее, словно погружаешься в динамичный сюжет сериала или кинофильма, с желанием досмотреть его до конца сразу же…",
                        Price = 90
                    },
                    new Book
                    {
                        Id = 5,
                        Title = "Таємниця Святоюрської гори: книга перша",
                        Language = "українська",
                        Year = 2017,
                        Format = "60х90/16",
                        Cover = "тверда",
                        PagesAmount = 348,
                        Description = "Історико-пригодницький роман «Таємниця Святоюрської гори» оповідає про події в Галичині під час її окупації російськими військами в період Першої світової війни (вересень 1914 – червень 1915 рр.). Спроби російської контррозвідки запровадити в шпигунську мережу австрійців капітана Бєлінського виявляють таємницю, яку ретельно приховують уніатські ченці в надрах Святоюрської гори. Читач познайомиться з атмосферою, що панувала в дні важких випробувань в багатонаціональному місті, багатьма історичними особистостями, які опинилися в той час у Львові, діяльністю російської адміністрації, що намагалася перетворити Галицький край в нові губернії Росії. В основу книги лягли матеріали з фондів російських та українських держархівів і бібліотек, а також спогади учасників описуваних подій.",
                        Price = 110
                    },
                    new Book
                    {
                        Id = 6,
                        Title = "Таємниця Святоюрської гори: книга друга",
                        Language = "українська",
                        Year = 2019,
                        Format = "60х90/16",
                        Cover = "тверда",
                        PagesAmount = 156,
                        Description = "Друга частина роману-дилогії «Таємниця Святоюрської гори» є самостійним цілісним твором і водночас продовженням першої частини. У попередній книзі події розгортаються у столиці Галичини в роки Першої світової війни, а друга книга занурює читача у вир Другої світової війни. Головний герой – російський офіцер царської армії, тричі відвідує Львів та щоразу застає місто в іншому державному підпорядкуванні – австрійському, польському та радянському. Художнє відтворення колоритного життя поліетнічної спільноти міста у драматичні та трагічні періоди його історії – це авторський задум. О. Богданович сповна його реалізував, спираючись на свідчення очевидців та їхні особисті архіви. Книга розрахована на широке коло читачів, передусім – шанувальників історико - пригодницького жанру, а також тих, хто цікавиться шпигунсько - контррозвідувальною тематикою, захоплюється історією Львова та прагне до глибокого її пізнання через виразне художнє слово.",
                        Price = 90
                    },
                    new Book
                    {
                        Id = 7,
                        Title = "Скоропадський, Маннергейм, Врангель: кавалеристи-державники",
                        Language = "українська",
                        Year = 2013,
                        Format = "60х84/8",
                        Cover = "м’яка ",
                        PagesAmount = 224,
                        Description = "Автор цієї книжки намагається зрозуміти суперечливу постать гетьмана Павла Скоропадського, порівнюючи його не з тогочасними українськими політиками, а з товаришами по службі: Карлом Густавом Маннергеймом та Петром Врангелем. Ці генерали-кавалеристи належали до свити останнього російського імператора і добре знали одне одного. До 1917 року їхні кар’єри розвивалися дуже схоже. Після розвалу Російської імперії вони почали на її уламках створювати нові держави. Впоратися із цим завданням пощастило лише Маннергейму.",
                        Price = 50
                    },
                    new Book
                    {
                        Id = 8,
                        Title = "Міфи Другої світової війни",
                        Language = "українська",
                        Year = 2011,
                        Format = "60х84/8",
                        Cover = "м’яка ",
                        PagesAmount = 140,
                        Description = "Чому кавалеристи не знали, що танк марно рубати шаблею? Де насправді відбулася найбільша танкова битва? Скільки чорнозему вивезли німці з окупованих територій?.. У цій книжці спростовуються поширені уявлення про війну 1939-1945 років, які насправді не відповідають дійсності, розповідається про те, як ці міфи з’явились і яким є їхнє реальне підґрунтя.",
                        Price = 40
                    },
                    new Book
                    {
                        Id = 9,
                        Title = "Місто виноградних слимаків",
                        Language = "українська",
                        Year = 2018,
                        Format = "70х84/16",
                        Cover = "м'яка",
                        PagesAmount = 24,
                        Description = "Авторські казкові історії про пригоди равлика Капучіно призначені для дітей дошкільного віку і покликані розвивати їх творче мислення та уяву. Переконані, що короткочасне повернення у казковий світ буде приємним та захопливим також і для їхніх батьків.",
                        Price = 30
                    },
                    new Book
                    {
                        Id = 10,
                        Title = "Застрелити шпака",
                        Language = "українська",
                        Year = 2017,
                        Format = "70х100/32",
                        Cover = "тверда",
                        PagesAmount = 120,
                        Description = "Як відомо, шпак – це невеличкий птах ряду горобцеподібних, який завдяки своїй здатності до багатоголосся нерідко передражнює інших пернатих, а деколи навіть і людей. Недарма ж українська версія його назви походить від праслов'янського \"ščьpakъ\", яке, своєю чергою, утворилося від дієслова \"ščipati\" – \"щипати\", вжитого у значенні \"дражнити\", \"імітувати\". Звісно, нічого страшного, якщо цей халамидник сидить на дереві і знущається зі своїх жертв дистанційно, але як бути, коли голосистий шибеник оселяється у чиїйсь голові? Перед вами збірка історій людей, про яких так і кажуть: \"має шпака\". Вони – поряд: ходять тими самими вулицями, їздять у маршрутках, метро чи електричках, сидять за сусідніми столиками у кнайпах. Однак дуже часто ми навіть не здогадуємося, що в головах цих людей виводить трелі Sturnus vulgaris.",
                        Price = 60
                    },
                    new Book
                    {
                        Id = 11,
                        Title = "Мелодія сердця",
                        Language = "українська",
                        Year = 2017,
                        Format = "60х84/16",
                        Cover = "м'яка",
                        PagesAmount = 164,
                        Description = "Вашій увазі пропонуємо книжку, що є результатом дослідження життєвого шляху непересічної особистості, перекладачки і фольклористки Ольги Рошкевич-Озаркевич, її стосунків з Іваном Франком на основі листування. В молоді роки їх поєднувало взаємне перше палке кохання, яке надихало поета на створення ліричних поезій. Проте закоханим не судилось бути разом. Читач дізнається маловідомі факти з життя Ольги та родини Рошкевичів, її чоловіка Володимира Озаркевича, Івана Франка і його соратників – Михайла та Анни Павликів. Рекомендуємо до прочитання дослідникам і шанувальникам творчості Івана Франка.",
                        Price = 90
                    },
                    new Book
                    {
                        Id = 12,
                        Title = "Кохання струни золоті",
                        Language = "українська",
                        Year = 2015,
                        Format = "60х84/32",
                        Cover = "м’яка",
                        PagesAmount = 208,
                        Description = "У цій книжечці зібрано рядки про кохання, написані українськими поетами різних часів. Вони засвідчують глибинну народну мудрість, довершеність і красу української мови. Метою цієї книжечки є утвердження верховенства любові.",
                        Price = 30
                    },
                    new Book
                    {
                        Id = 13,
                        Title = "Енциклопедія афоризмів, крилатих фраз, цитат",
                        Language = "українська",
                        Year = 2011,
                        Format = "60х84/8",
                        Cover = "тверда ",
                        PagesAmount = 960,
                        Description = "Дана книга – унікальне в поліграфії видання – є підсумком копіткої багаторічної праці, започаткованої ще наприкінці 60-х років минулого століття. Книга, яка, власне, успішно витримала вже два видання у 2004 і 2008 роках, узагальнює і суттєво розширює «досвід» попередниць у кількості процитованих висловів, представлених авторів та «навігації» тематичного, алфавітного і географічного покажчиків. Всього у пропонованій Енциклопедії зібрано понад 19 200 афоризмів, крилатих фраз, цитат і висловів 3 300 авторів – про природу творчості, про майстерність журналіста, про ЗМІ та свободу слова, про зв’язки журналістики з іншими сферами буття тощо.",
                        Price = 280
                    },
                    new Book
                    {
                        Id = 14,
                        Title = "Практична стилістика української мови",
                        Language = "українська",
                        Year = 2007,
                        Format = "60х84/16",
                        Cover = "тверда",
                        PagesAmount = 400,
                        Description = "Посібник містить основні положення курсу \"Практичної стилістики української мови\", який вивчають студенти факультету журналістики. Книга охоплює всі розділи цього курсу: в ній висвітлено особливості стилістичного використання в мові ЗМІ лексичних, фразеологічних, морфологічних і синтаксичних засобів. Сформульовано питання для самоперевірки і перелік завдань.",
                        Price = 70
                    },
                    new Book
                    {
                        Id = 15,
                        Title = "Редагування в засобах масової інформації",
                        Language = "українська",
                        Year = 2009,
                        Format = "70х100/16",
                        Cover = "тверда ",
                        PagesAmount = 432,
                        Description = "У посібнику викладено основні теоретичні положення курсу «Редагування в ЗМІ». До кожної теми подано також питання для самоперевірки, практичні завдання і рекомендовану літературу. Навчальним посібником можуть скористатися не тільки студенти факультету журналістики, для яких його, власне, й призначено, але й журналісти - практики, а також працівники всіх сфер діяльності, чия робота пов’язана з редагуванням і саморедагуванням.",
                        Price = 80
                    },
                    new Book
                    {
                        Id = 16,
                        Title = "Телебачення прямого ефіру: практика мовлення, типові помилки",
                        Language = "українська",
                        Year = 2011,
                        Format = "70х100/16",
                        Cover = "тверда",
                        PagesAmount = 400,
                        Description = "У посібнику висвітлено специфіку праці журналістів у прямому ефірі. Книга, зокрема, охоплює особливості стилістичного використання в мовленні працівників телебачення лексичних, фразеологічних, морфологічних і синтаксичних засобів, дає рекомендації для глибшого засвоєння норм акцентології. Подано питання для самоперевірки і завдання.",
                        Price = 80
                    },
                    new Book
                    {
                        Id = 17,
                        Title = "Телевізійна журналістика",
                        Language = "українська",
                        Year = 2009,
                        Format = "60х84/16 ",
                        Cover = "м’яка ",
                        PagesAmount = 224,
                        Description = "У посібнику розглянуто специфіку тележурналістики, особливості роботи журналіста на телебаченні, аудіовізуальні жанри, технологію підготовки окремих матеріалів, проблеми сучасного ефірного телемовлення, коротко пояснено телевізійну термінологію. Для студентів факультетів та відділень журналістики університетів, творчих працівників телебачення.",
                        Price = 50
                    },
                    new Book
                    {
                        Id = 18,
                        Title = "Інтернет-журналістика",
                        Language = "українська",
                        Year = 2010,
                        Format = "60х84/16",
                        Cover = "тверда",
                        PagesAmount = 246,
                        Description = "Автор розглядає інтернет-журналістику як історично четвертий (після преси, радіо і телебачення) різновид журналістики. Посібник містить практичні рекомендації стосовно підготовки і техніки написання матеріалів для новинно-аналітичних онлайнових ресурсів, а також прогнози розвитку мережевих медій.",
                        Price = 60
                    },
                    new Book
                    {
                        Id = 19,
                        Title = "Соціологія і журналістика",
                        Language = "українська",
                        Year = 2013,
                        Format = "60х84/16 ",
                        Cover = "м’яка ",
                        PagesAmount = 232,
                        Description = "У книзі з’ясовано вплив соціології на суспільну, передусім журналістську діяльність, проаналізовано використання соціологічних методів у журналістській практиці. Підручник дає загальне уявлення про соціологію як науку, про соціологічні методи збору інформації, про методику проведення конкретного соціологічного дослідження, про вплив соціологічної методики на роботу журналіста, значення соціології у журналістській діяльності.",
                        Price = 70
                    },
                    new Book
                    {
                        Id = 20,
                        Title = "Соціальна психологія масової комунікації",
                        Language = "українська",
                        Year = 2013,
                        Format = "60х84/16 ",
                        Cover = "м’яка ",
                        PagesAmount = 252,
                        Description = "У підручнику проаналізовано застосування методів соціальної психології у журналістській практиці, розкрито з соціально- психологічної точки зору журналістську методику збору інформації та спілкування журналіста з аудиторією. Для студентів вищих навчальних закладів, журналістів-практиків.",
                        Price = 70
                    },
                    new Book
                    {
                        Id = 21,
                        Title = "Теорія і методика журналістської творчості",
                        Language = "українська",
                        Year = 2008,
                        Format = "60х84/16",
                        Cover = "м'яка",
                        PagesAmount = 276,
                        Description = "Пропонована книга – перший у пострадянських країнах підручник, присвячений найважливішій частині теорії та практики журналізму: аналізу природи літературної праці у засобах масової інформації.",
                        Price = 100
                    },
                    new Book
                    {
                        Id = 22,
                        Title = "Журналистика и культура: динамика взаимодействия",
                        Language = "російська",
                        Year = 2013,
                        Format = "60х84/16",
                        Cover = "тверда",
                        PagesAmount = 288,
                        Description = "Данное учебное пособие – это попытка представить журналистику как продукт духовной культуры общества, рассмотреть культурологические аспекты журналистики, ее место в глобальном контексте социокультурной динамики. Теоретико- методологическое осмысление особенностей журналистики как культурного феномена сопровождается организацией познавательной деятельности студентов при постановке и решении культурологических проблем на основе изучения первоисточников, ознакомления со спорными точками зрения. Учебное пособие носит междисциплинарный характер, хотя ориентировано, прежде всего, на студентов-журналистов, но, тем не менее, представляет интерес для специалистов самых разных научных направлений.",
                        Price = 70
                    },
                    new Book
                    {
                        Id = 23,
                        Title = "Сучасний англомовний світ і збагачення словникового складу",
                        Language = "українська",
                        Year = 2007,
                        Format = "60х84/16",
                        Cover = "м’яка",
                        PagesAmount = 228,
                        Description = "У навчальному посібнику розглянуто соціальні параметри інноваційних процесів в англійській мові на початку ХХІ сторіччя, якісні зміни в шляхах, способах, тенденціях і механізмах збагачення словникового складу. Для студентів, аспірантів, викладачів, науковців.",
                        Price = 50
                    },
                    new Book
                    {
                        Id = 24,
                        Title = "Велика Британія: географія, історія, культура",
                        Language = "українська",
                        Year = 2012,
                        Format = "60х84/16",
                        Cover = "тверда",
                        PagesAmount = 496,
                        Description = "У навчальному посібнику вперше зроблено спробу комплексно висвітлити сучасну географію Великої Британії, її соціально- економічну й політичну історію, процес зародження та розвитку британської культури від найдавніших часів до сьогодення.",
                        Price = 100
                    }
                );
            modelBuilder.Entity<BookAuthor>()
                .HasData(
                    new BookAuthor
                    {
                        Id = 1,
                        BookId = 1,
                        AuthorId = 1
                    },
                    new BookAuthor
                    {
                        Id = 2,
                        BookId = 2,
                        AuthorId = 2
                    },
                    new BookAuthor
                    {
                        Id = 3,
                        BookId = 3,
                        AuthorId = 3
                    },
                    new BookAuthor
                    {
                        Id = 4,
                        BookId = 4,
                        AuthorId = 3
                    },
                    new BookAuthor
                    {
                        Id = 5,
                        BookId = 5,
                        AuthorId = 4
                    },
                    new BookAuthor
                    {
                        Id = 6,
                        BookId = 6,
                        AuthorId = 4
                    },
                    new BookAuthor
                    {
                        Id = 7,
                        BookId = 7,
                        AuthorId = 5
                    },
                    new BookAuthor
                    {
                        Id = 8,
                        BookId = 8,
                        AuthorId = 5
                    },
                    new BookAuthor
                    {
                        Id = 9,
                        BookId = 9,
                        AuthorId = 6
                    },
                    new BookAuthor
                    {
                        Id = 10,
                        BookId = 10,
                        AuthorId = 7
                    },
                    new BookAuthor
                    {
                        Id = 11,
                        BookId = 11,
                        AuthorId = 8
                    },
                    new BookAuthor
                    {
                        Id = 12,
                        BookId = 12,
                        AuthorId = 9
                    },
                    new BookAuthor
                    {
                        Id = 13,
                        BookId = 13,
                        AuthorId = 10
                    },
                    new BookAuthor
                    {
                        Id = 14,
                        BookId = 14,
                        AuthorId = 10
                    },
                    new BookAuthor
                    {
                        Id = 15,
                        BookId = 15,
                        AuthorId = 10
                    },
                    new BookAuthor
                    {
                        Id = 16,
                        BookId = 16,
                        AuthorId = 10
                    },
                    new BookAuthor
                    {
                        Id = 17,
                        BookId = 17,
                        AuthorId = 11
                    },
                    new BookAuthor
                    {
                        Id = 18,
                        BookId = 18,
                        AuthorId = 12
                    },
                    new BookAuthor
                    {
                        Id = 19,
                        BookId = 19,
                        AuthorId = 13
                    },
                    new BookAuthor
                    {
                        Id = 20,
                        BookId = 20,
                        AuthorId = 13
                    },
                    new BookAuthor
                    {
                        Id = 21,
                        BookId = 21,
                        AuthorId = 14
                    },
                    new BookAuthor
                    {
                        Id = 22,
                        BookId = 22,
                        AuthorId = 15
                    },
                    new BookAuthor
                    {
                        Id = 23,
                        BookId = 23,
                        AuthorId = 16
                    },
                    new BookAuthor
                    {
                        Id = 24,
                        BookId = 24,
                        AuthorId = 17
                    },
                    new BookAuthor
                    {
                        Id = 25,
                        BookId = 24,
                        AuthorId = 18
                    }
                );
            modelBuilder.Entity<BookCategory>()
                .HasData(
                    new BookCategory
                    {
                        Id = 1,
                        BookId = 1,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 2,
                        BookId = 2,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 3,
                        BookId = 3,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 4,
                        BookId = 4,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 5,
                        BookId = 5,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 6,
                        BookId = 6,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 7,
                        BookId = 7,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 8,
                        BookId = 8,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 9,
                        BookId = 9,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 10,
                        BookId = 10,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 11,
                        BookId = 11,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 12,
                        BookId = 12,
                        CategoryId = 1
                    },
                    new BookCategory
                    {
                        Id = 13,
                        BookId = 13,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 14,
                        BookId = 14,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 15,
                        BookId = 15,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 16,
                        BookId = 16,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 17,
                        BookId = 17,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 18,
                        BookId = 18,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 19,
                        BookId = 19,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 20,
                        BookId = 20,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 21,
                        BookId = 21,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 22,
                        BookId = 22,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 23,
                        BookId = 23,
                        CategoryId = 2
                    },
                    new BookCategory
                    {
                        Id = 24,
                        BookId = 24,
                        CategoryId = 2
                    }
                );
        }
    }
}
